In [40]:
def coba_if(n):
    list_data = []
    for i in range(n):
        data = i+1
        list_data.append(data)
    return list_data

list_data = coba_if(10)
list_data

[1, 2, 3, 4, 5, 6, 7, 8, 9, 10]

In [41]:
#salah
def add_item(nama, jumlah, harga):
    add_to_cart = []
    add_to_cart.append([nama, jumlah, harga])
    return add_to_cart

cart = add_item("milo", 1, 20_000)
cart.append(cart)

add_item("milo", 1, 20_000)
print(cart)

[['milo', 1, 20000], [...]]

In [42]:
list_belanjaan = []
def add_jumlah(jumlah_jenis_belanjaan):
    #list_belanjaan = []
    
    for i in range(jumlah_jenis_belanjaan):        
        nama_item = input("Masukkan produk yang ingin dibeli : ")
        jumlah_item = int(input("Masukkan jumlah produk yang ingin dibeli : "))
        harga_per_item = float(input("Masukkan harga per item produk yang ingin dibeli : Rp "))

        add_to_cart = [nama_item, jumlah_item, harga_per_item]
        list_belanjaan.append(add_to_cart)
    return list_belanjaan

In [43]:
add_jumlah(2)

ValueError: invalid literal for int() with base 10: ''

In [ ]:
add_jumlah(1)

[['mie', 10, 35000.0], ['sabun', 1, 17000.0], ['sunlight', 1, 18000.0]]

In [ ]:
import pandas as pd
import numpy as np

df = pd.DataFrame(list_belanjaan, columns = ['nama_item', 'jumlah_item', 'harga_per_item'])
df.index = np.arange(1, len(df) + 1)
display(df)

  nama_item  jumlah_item  harga_per_item
1       mie           10         35000.0
2     sabun            1         17000.0
3  sunlight            1         18000.0

In [ ]:
display(df)

  nama_item  jumlah_item  harga_per_item
1       mie           10         35000.0
2     sabun            1         17000.0
3  sunlight            1         18000.0

In [ ]:
df['total_belanja'] = df['jumlah_item'] * df['harga_per_item']
display(df)

  nama_item  jumlah_item  harga_per_item  total_belanja
1       mie           10         35000.0       350000.0
2     sabun            1         17000.0        17000.0
3  sunlight            1         18000.0        18000.0

In [ ]:
np.sum(df['total_belanja'])

385000.0

In [ ]:
display(df)

       nama_item  jumlah_item  harga_per_item  total_belanja
1  supermi 1 box           10         35000.0       350000.0
2          sabun            1         17000.0        17000.0
3     mama lemon            1         18000.0        18000.0

In [ ]:
def update_item_name(nama_item, nama_item_baru):
    for i in range(len(df)):
        if df['nama_item'][i+1] == nama_item:
            df['nama_item'][i+1] = df['nama_item'][i+1].replace(df['nama_item'][i+1], nama_item_baru)

    return list_belanjaan
#return list_belanjaan, trnsct_123, self_service_cashier()

In [ ]:
list_belanjaan

[['mie', 10, 35000.0], ['sabun', 1, 17000.0], ['sunlight', 1, 18000.0]]

In [ ]:
def update_item_name():
    nama_item = input("Masukkan nama produk yg ingin diganti")
    nama_item_baru = input("Masukkan nama produk pengganti")

    def update_detail(nama_item, nama_item_baru):
        for i in range(len(list_belanjaan)):
            nama = list_belanjaan[i][1]
            if nama == nama_item:
                list_belanjaan[i][1] = list_belanjaan[i][1].replace(nama_item, nama_item_baru)
        return list_belanjaan

    df = pd.DataFrame(list_belanjaan, columns = ['nama_item', 'jumlah_item', 'harga_per_item'])
    df.index = np.arange(1, len(df) + 1)
    display(df)

    return list_belanjaan

In [ ]:
update_item_name()

  nama_item  jumlah_item  harga_per_item
1       mie           10         35000.0
2     sabun            1         17000.0
3  sunlight            1         18000.0

([['mie', 10, 35000.0], ['sabun', 1, 17000.0], ['sunlight', 1, 18000.0]],
 [['mie', 10, 35000.0], ['sabun', 1, 17000.0], ['sunlight', 1, 18000.0]])

In [ ]:
def update_item_name(nama_item, nama_item_baru):
    for i in range(len(list_belanjaan)):
        if list_belanjaan[i][1] == nama_item:
            list_belanjaan[i][1] = list_belanjaan[i][1].replace(nama_item, nama_item_baru)

    return list_belanjaan

In [50]:
def transaction():
  "Fungsi untuk membuat ID transaksi setiap customer, bersifat unik"
  import uuid
  #random_uuid = uuid.uuid4()
  list_belanjaan = []
  trnsct_123 = uuid.uuid4()
  return list_belanjaan, trnsct_123

# memanggil fungsi
transaction()

([], UUID('914b40c7-6f33-4969-8c53-712c52d0af5b'))

In [48]:
def update_detail(nama_item, nama_item_baru):
    "Fungsi untuk melakukan perubahan pada nama produk"
    list_belanjaan = [['a','b','c'],['d','e','f']]
    for i in range(len(list_belanjaan)):
        nama = list_belanjaan[i][1]
        if nama == nama_item:
            list_belanjaan[i][1] = list_belanjaan[i][1].replace(nama_item, nama_item_baru)
    return list_belanjaan

In [49]:
list_belanjaan = [['a','b','c'],['d','e','f']]
update_detail('a', 'xxxxx')

[['a', 'b', 'c'], ['d', 'e', 'f']]

In [45]:
list_belanjaan

[['a', 1, 15500.0]]

In [ ]:
list_a = [100_000, 200_000, 500_000, 750_000]

import pandas as pd
df = pd.DataFrame(list_a, columns =['TotalHarga'])
df

   TotalHarga
0      100000
1      200000
2      500000
3      750000

In [52]:
import pandas as pd
list_a = [100_000, 200_000, 500_000, 750_000]

disc_200 = 0.05
disc_300 = 0.06
disc_500 = 0.07
list_diskon = []
for i in list_a:
    if i > 500_000:
        i = i * disc_500
    elif i > 300_000:
        i = i * disc_300
    elif i > 200_000:
        i = i * disc_200
    else:
        i = 0
    list_diskon.append(i)

df = pd.DataFrame(list(zip(list_a, list_diskon)),
               columns =['TotalHarga', 'Diskon'])
df['Harga_Final'] = df['TotalHarga'] - df['Diskon']
df

   TotalHarga   Diskon  Harga_Final
0      100000      0.0     100000.0
1      200000      0.0     200000.0
2      500000  30000.0     470000.0
3      750000  52500.0     697500.0

In [53]:
list_a = [[1, 100_000], [2, 200_000], [1, 500_000],[1, 750_000]]
list_total_harga = []

for i in range(len(list_a)):
    total_harga = list_a[i][0] * list_a[i][1]
    list_total_harga.append(total_harga)

list_total_harga

[100000, 400000, 500000, 750000]

In [54]:
DISC_200 = 0.05
DISC_300 = 0.06
DISC_500 = 0.07

list_diskon = []
for i in range(len(list_total_harga)):
    if list_total_harga[i] > 500_000:
        disc = list_total_harga[i] * DISC_500
    elif list_total_harga[i] > 300_000:
        disc = list_total_harga[i] * DISC_300
    elif list_total_harga[i] > 200_000:
        disc = list_total_harga[i] * DISC_200
    else:
        disc = 0
    list_diskon.append(disc)

list_diskon

[0, 24000.0, 30000.0, 52500.00000000001]

In [55]:
df1 = pd.DataFrame(list_a, columns = ['Qty', 'Harga'])
df2 = pd.DataFrame(list_total_harga, columns = ['TotalHarga'])
df3 = pd.DataFrame(list_diskon, columns = ['diskon'])
df = pd.concat([df1, df2, df3], axis = 1)
df['HargaFinal'] = df['TotalHarga'] - df['diskon']
display(df)

   Qty   Harga  TotalHarga   diskon  HargaFinal
0    1  100000      100000      0.0    100000.0
1    2  200000      400000  24000.0    376000.0
2    1  500000      500000  30000.0    470000.0
3    1  750000      750000  52500.0    697500.0

In [58]:
import uuid
trnsct_123 = uuid.uuid4()
df['kode_transaksi'] = trnsct_123
display(df)

,Qty,Harga,TotalHarga,diskon,HargaFinal,kode_transaksi
0,1,100000,100000,0.0,100000.0,c2e1e7e5-d969-41a7-8e4b-4f6e2127d844
1,2,200000,400000,24000.0,376000.0,c2e1e7e5-d969-41a7-8e4b-4f6e2127d844
2,1,500000,500000,30000.0,470000.0,c2e1e7e5-d969-41a7-8e4b-4f6e2127d844
3,1,750000,750000,52500.0,697500.0,c2e1e7e5-d969-41a7-8e4b-4f6e2127d844

In [65]:
df['kode_transaksi'].unique()[0]

UUID('c2e1e7e5-d969-41a7-8e4b-4f6e2127d844')

In [67]:
import numpy as np
np.unique(df['kode_transaksi'])[0]

UUID('c2e1e7e5-d969-41a7-8e4b-4f6e2127d844')

In [57]:
x = round(5.76543, 2)
print(x)

5.77

In [ ]:
def start():
  print("-" * 48)
  print(" ","*" * 7,"SELF-SERVICE CASHIER Register","*" * 7," ")
  print("-" * 48)
  print("\n"* 3)

  
  feature_menu = input("Apakah Anda ingin memulai? (ya / tidak) ")
  print("-" * 48)

"""  if feature_menu == "ya":
    #list_belanjaan = []
    #list_belanjaan.clear()
    #transaction()
    #list_belanjaan, trnsct_123 = transaction()
    # self_service_cashier()
    #print(f"ID transaksi Anda {trnsct_123}")
    return list_belanjaan, trnsct_123, f"ID transaksi Anda {trnsct_123}", self_service_cashier()
    #return trnsct_123
  else:
    pass"""

'  if feature_menu == "ya":\n    #list_belanjaan = []\n    #list_belanjaan.clear()\n    #transaction()\n    #list_belanjaan, trnsct_123 = transaction()\n    # self_service_cashier()\n    #print(f"ID transaksi Anda {trnsct_123}")\n    return list_belanjaan, trnsct_123, f"ID transaksi Anda {trnsct_123}", self_service_cashier()\n    #return trnsct_123\n  else:\n    pass'

In [ ]:
start()

------------------------------------------------
  ******* SELF-SERVICE CASHIER Register *******
------------------------------------------------




------------------------------------------------

In [ ]:
l = ['Alice', 'Bob', 'Charlie', 'Bob', 'Dave']

l.remove('Alice')
print(l)
# ['Bob', 'Charlie', 'Bob', 'Dave']

['Bob', 'Charlie', 'Bob', 'Dave']

In [ ]:
list_a = [['alpha', 1, 100_000], ['beta', 2, 200_000], ['gama', 1, 500_000],['omega', 1, 750_000]]

delete_item = 'gama'
for i in range(len(list_a)):
    if list_a[i][0] == delete_item:
        list_a = list_a.remove(list_a[i])
print(list_a)

TypeError: 'NoneType' object is not subscriptable

In [ ]:
list_a = [['alpha', 1, 100_000], ['beta', 2, 200_000], ['gama', 1, 500_000],['omega', 1, 750_000]]
list_a.remove(list_a[0])
list_a

[['beta', 2, 200000], ['gama', 1, 500000], ['omega', 1, 750000]]

In [ ]:
list_a = [['alpha', 1, 100_000], ['beta', 2, 200_000], ['gama', 1, 500_000],['omega', 1, 750_000]]        
nama_item = 'omega'
update_harga_per_item = 1_000_000
for i in range(len(list_a)):
    if nama_item == list_a[i][0]:
        list_a[i][2] = update_harga_per_item

print(list_a)

[['alpha', 1, 100000], ['beta', 2, 200000], ['gama', 1, 500000], ['omega', 1, 1000000]]

In [ ]:
list_a[2][0]

'gama'

In [ ]:
list_a = [['alpha', 1, 100_000], ['beta', 2, 200_000], ['gama', 1, 500_000],['omega', 1, 750_000]]        
#nama_item = 'omega'
delete_item = 'gama'
for i in range(len(list_a)):
    #print(i, list_a[i][0])
    if delete_item == list_a[i][0]:
        list_a.remove(list_a[i])
        
        print(list_a)
        break
        


#print(list_a)

[['alpha', 1, 100000], ['beta', 2, 200000], ['omega', 1, 750000]]

In [18]:
def save_customer(id_customer: int, nama: str, alamat: str, kota: str, kode_pos: str, telepon: str):
    import sqlite3 
    con = sqlite3.connect("coba.db")
    cur = con.cursor()

    # simpan ke database
    cur.execute(f'INSERT INTO customer_coba VALUES ("{id_customer}", "{nama}", "{alamat}", "{kota}", "{kode_pos}", "{telepon}")')
    
    con.commit()
    #con.close()

In [19]:
# masukkan dalam database menggunakan sqlite3
import sqlite3 
con = sqlite3.connect("coba.db")
cur = con.cursor()

cur.execute("""CREATE TABLE IF NOT EXISTS customer_coba(
            id_customer INTEGER AUTO_INCREMENT PRIMARY KEY,
            nama TEXT, 
            alamat TEXT, 
            kota TEXT,
            kode_pos TEXT,
            telepon TEXT)""")

nama = input("Nama customer : ")
alamat = input("Alamat customer : ")
kota = input("Kota / Kabupaten : ")
kode_pos = input("Kode pos : ")
telepon = input("No telepon : ")

save_customer(nama, alamat, kota, kode_pos, telepon)

TypeError: save_customer() missing 1 required positional argument: 'telepon'

In [21]:
import sqlite3
data_person_name = [('Michael', 'Fox'),
                    ('Adam', 'Miller'),
                    ('Andrew', 'Peck'),
                    ('James', 'Shroyer'),
                    ('Eric', 'Burger')]

con = sqlite3.connect("coba.db")

with con:

    c = con.cursor()

    c.execute('''CREATE TABLE q1_person_name
                (name_id INTEGER PRIMARY KEY,
                first_name varchar(20) NOT NULL,
                last_name varchar(20) NOT NULL)''')
    c.executemany('INSERT INTO q1_person_name(first_name, last_name) VALUES (?,?)', data_person_name)

    for row in c.execute('SELECT * FROM q1_person_name'):
        print(row)

(1, 'Michael', 'Fox')
(2, 'Adam', 'Miller')
(3, 'Andrew', 'Peck')
(4, 'James', 'Shroyer')
(5, 'Eric', 'Burger')

In [31]:
import pandas as pd
import numpy as np

data = {'product_name': ['Computer','Tablet','Monitor','Printer'],
        'price': [900,300,450,150]
        }

df = pd.DataFrame(data, columns= ['product_name','price'])
df.index = np.arange(1, len(df) + 1)
print (df)

  product_name  price
1     Computer    900
2       Tablet    300
3      Monitor    450
4      Printer    150

In [32]:
import sqlite3

# masukkan dalam database menggunakan sqlite3
con = sqlite3.connect("coba.db")
cur = con.cursor()

# sql table = tabel transaction
cur.execute("""CREATE TABLE IF NOT EXISTS products(
            product_name TEXT NOT NULL, 
            price REAL NOT NULL
            )""")

# melakukan export dataframe transaksi ke bentuk sql
df.to_sql('products', con, if_exists = 'replace', method = None) # if exists = 'append' kalo sdh ok

4